<template>
    <app-header title="Наши услуги" back="true">

        <div class="card-link">
            <div class="link-container">
                <a :href="item.idx" class="link-router" v-for="item in service" :key="item.id">{{ item.name }}</a>
            </div>
        </div>

    </app-header>
    <div class="wrapper">
        <div class="card" id="1">
            <h2 class="card-title">Окрашивание волос</h2>
            <app-card title="Тонирование (короткие)" img=""
                subtitle="В отличие от краски, тонирование не вредит волосам и не истощает их, но делает волосы гладкими и оживленными. Используя легкие оттеночные средства, мы получаем ровный впечатляющий цвет и объем."
                price="
2 800"></app-card>
            <app-card title="Тонирование (средние)" img=""
                subtitle="В отличие от краски, тонирование не вредит волосам и не истощает их, но делает волосы гладкими и оживленными. Используя легкие оттеночные средства, мы получаем ровный впечатляющий цвет и объем."
                price="3 400"></app-card>
            <app-card title="Тонирование (длинные)" img=""
                subtitle="В отличие от краски, тонирование не вредит волосам и не истощает их, но делает волосы гладкими и оживленными. Используя легкие оттеночные средства, мы получаем ровный впечатляющий цвет и объем."
                price="4 000"></app-card>
            <app-card title="Сложное окрашивание частичное + тонирование (короткие)" img="" subtitle="Полноценная услуга, но в охвате 50% волос на голове.
" price="4 800"></app-card>
            <app-card title="Сложное окрашивание частичное + тонирование (средние)" img=""
                subtitle="Полноценная услуга, но в охвате 50% волос на голове." price="6 500"></app-card>
            <app-card title="Сложное окрашивание частичное + тонирование (длинные)" img=""
                subtitle="Полноценная услуга, но в охвате 50% волос на голове." price="8 400"></app-card>
            <app-card title="Сложное окрашивание + тонирование (короткие)" img=""
                subtitle="Включает в себя комплекс из услуг любой техники растяжки и рельефа цвета, выполняемой через обесцвечивание (шатуш/балаяж/airtouch). Дополняется тонированием. Может выполняться в форме комплекса, объединяющего в себе любую технику растяжки или рельефа (шатуш/балаяж/airtouch) и красителя."
                price="9 600"></app-card>
            <app-card title="Сложное окрашивание + тонирование (средние)" img=""
                subtitle="Включает в себя комплекс из услуг любой техники растяжки и рельефа цвета, выполняемой через обесцвечивание (шатуш/балаяж/airtouch). Дополняется тонированием. Может выполняться в форме комплекса, объединяющего в себе любую технику растяжки или рельефа (шатуш/балаяж/airtouch) и красителя."
                price="13 000"></app-card>
            <app-card title="Сложное окрашивание + тонирование (длинные)" img=""
                subtitle="Включает в себя комплекс из услуг любой техники растяжки и рельефа цвета, выполняемой через обесцвечивание (шатуш/балаяж/airtouch). Дополняется тонированием. Может выполняться в форме комплекса, объединяющего в себе любую технику растяжки или рельефа (шатуш/балаяж/airtouch) и красителя."
                price="16 800"></app-card>
            <app-card title="Обесцвечивание + тонирование (короткие)" img=""
                subtitle="Выведение цветного пигмента с дальнейшим тонированием." price="7 000"></app-card>
            <app-card title="Обесцвечивание + тонирование (средние)" img=""
                subtitle="Выведение цветного пигмента с дальнейшим тонированием." price="8 300"></app-card>
            <app-card title="Обесцвечивание + тонирование (длинные)" img=""
                subtitle="Выведение цветного пигмента с дальнейшим тонированием." price="9 400"></app-card>
            <app-card title="Корни (до 2,5 см)" img=""
                subtitle="Отросшие корни могут быть хороши только при омбре. Все остальное предоставьте стилистам SODA."
                price="2 400"></app-card>
            <app-card title="Контуринг + тонирование контуринга" img=""
                subtitle="Полноценная услуга, но в охвате 10% волос на голове." price="3 000"></app-card>
            <app-card title="В один тон (короткие)" img=""
                subtitle="Идеально ровное окрашивание в один тон по всей длине: от корней до кончиков."
                price="3 400"></app-card>
            <app-card title="В один тон (средние)" img=""
                subtitle="Идеально ровное окрашивание в один тон по всей длине: от корней до кончиков."
                price="4 300"></app-card>
            <app-card title="В один тон (длинные)" img=""
                subtitle="Идеально ровное окрашивание в один тон по всей длине: от корней до кончиков."
                price="5 100"></app-card>
        </div>
        <div class="card" id="2">
            <h2 class="card-title">Комплекс услуг</h2>
            <app-card title="Снятие гель-лака + маникюр + выравнивание + покрытие гель-лаком" img=""
                subtitle="Комплекс для полноценного маникюра с покрытием и со скидкой. Индивидуальный набор не входит в стоимость комплекса и оплачивается отдельно + 40 руб."
                price="2 100"></app-card>
            <app-card title="Снятие гель-лака + педикюр + покрытие гель-лаком" img="" subtitle="Комплекс для идеальных пальчиков от и до. Включает в себя весь процесс педикюра и работы с покрытием. В стоимость не включен индивидуальный набор (40 рублей)
" price="2 750"></app-card>
            <app-card title="Снятие гель-лака + маникюр + выравнивание + покрытие гель-лаком" img=""
                subtitle="Комплекс для полноценного маникюра с покрытием и со скидкой. Индивидуальный набор не входит в стоимость комплекса и оплачивается отдельно + 40 руб."
                price="2 600"></app-card>
            <app-card title="Снятие гель-лака + педикюр + покрытие гель-лаком" img=""
                subtitle="Комплекс для идеальных пальчиков от и до. Включает в себя весь процесс педикюра и работы с покрытием. В стоимость не включен индивидуальный набор (40 рублей)"
                price="3 150"></app-card>
            <app-card title="Окрашивание + счастье для бровей" img=""
                subtitle="Комплекс по окрашиванию бровей краской и восстановлению волосков после частого окрашивания. Благодаря натуральному составу, волоски становятся послушными и блестящими, их проще укладывать."
                price="1 100"></app-card>
            <app-card title="Архитектура бровей + счастье для бровей" img=""
                subtitle="Комплекс по архитектуре бровей и восстановлению волосков после частого окрашивания. Благодаря натуральному составу, волоски становятся послушными и блестящими, их проще укладывать."
                price="2 000"></app-card>
            <app-card title="Ламинирование + счастье для бровей" img=""
                subtitle="Комплекс по ламинированию бровей и восстановлению волосков после частого окрашивания. Благодаря натуральному составу, волоски становятся послушными и блестящими, их проще укладывать."
                price="2 300"></app-card>
        </div>
        <div class="card" id="3">
            <h2 class="card-title">Маникюр</h2>
            <app-card title="Маникюр" img="" subtitle="Обработка ваших пальчиков на руках для их ухоженного вида и дальнейшего покрытия (или без него). Осуществляется в классической или комбинированной технике на ваше усмотрение. Наши мастера заботливо порекомендуют технику маникюра, которая подойдет именно вам. В стоимость не включен индивидуальный набор (40 рублей).
ещё" price="700"></app-card>
            <app-card title="Маникюр" img="" subtitle="Обработка ваших пальчиков на руках для их ухоженного вида и дальнейшего покрытия (или без него). Осуществляется в классической или комбинированной технике на ваше усмотрение. Наши мастера заботливо порекомендуют технику маникюра, которая подойдет именно вам. В стоимость не включен индивидуальный набор (40 рублей).
ещё" price="1 000"></app-card>
            <app-card title="Детский маникюр" img="" subtitle="Щадящий необрезной маникюр для мальчиков и девочек до 12 лет. Носит гигиенический и эстетический характер. В стоимость не включен индивидуальный набор (40 рублей)
ещё" price="500"></app-card>
            <app-card title="Снятие обычного лака" img="" subtitle="Снятие обычного лака жидкостью.
" price="150"></app-card>
            <app-card title="Снятие гель-лака" img="" subtitle="Снятие гель-лака аппаратом (фрезой). Помогает быстро и безболезненно, не повреждая ноготь, снять долговременное покрытие (рекомендуется при дальнейшем покрытии гель-лаком).
ещё" price="250"></app-card>
            <app-card title="Снятие геля/акрила" img="" subtitle="Безопасное снятие покрытия специальной маникюрной фрезой, которая не вредит живому ногтю и не травмирует его.
ещё" price="600"></app-card>
            <app-card title="Снятие гель-лака жидкостью" img="" subtitle="Снятие жидкостью подойдет для тех, кто не планирует снова покрывать ногти гель-лаком. Позволяет полностью очистить ногтевую пластину от покрытия путем замачивания в жидкости.
ещё" price="400"></app-card>
            <app-card title="Придание формы" img="" subtitle="Квадрат, миндаль и все остальное (без маникюра)."
                price="200"></app-card>
        </div>
        <div class="card" id="4">
            <h2 class="card-title">Педикюр</h2>
            <app-card title="SMART-педикюр" img=""
                subtitle="SMART-педикюр – это технология обработки стопы аппаратом с использованием специального шлифовального диска."
                price="2 150"></app-card>
            <app-card title="Педикюр" img=""
                subtitle="Сочетание аппаратной и обрезной техники продлевает жизнь педикюру и делает его чище обычной классики или аппарата по отдельности. В стоимость не включен индивидуальный набор (40 рублей)."
                price="1 700"></app-card>
            <app-card title="Экспресс педикюр" img=""
                subtitle="Экспресс-педикюр в SODA делается без обработки ступней в классической или комбинированной технике. При выборе классической техники обработки пальчиков будет использована специальная эмульсия, размягчающая кутикулу, вместо замачивания ножек в ванночке. В стоимость не включен индивидуальный набор (40 рублей)."
                price="1 100"></app-card>
            <app-card title="SMART-педикюр" img=""
                subtitle="SMART-педикюр – это технология обработки стопы аппаратом с использованием специального шлифовального диска."
                price="1 950"></app-card>
            <app-card title="Педикюр" img=""
                subtitle="Обработка ваших пальчиков ног и ступней по классической или комбинированной технике с аппаратом на ваш выбор. Наши мастера всегда помогут вам подобрать необходимую технику именно для ваших ножек. В стоимость не включен индивидуальный набор (40 рублей)."
                price="1 500"></app-card>
            <app-card title="Экспресс педикюр" img=""
                subtitle="Экспресс-педикюр в SODA делается без обработки ступней в классической или комбинированной технике. При выборе классической техники обработки пальчиков будет использована специальная эмульсия, размягчающая кутикулу, вместо замачивания ножек в ванночке. В стоимость не включен индивидуальный набор (40 рублей)."
                price="900"></app-card>
            <app-card title="Снятие гель-лака" img=""
                subtitle="Аппаратное удаление гель-лака, не наносящее вред ногтевой пластине и не травмирующее ее."
                price="250"></app-card>
            <app-card title="Экспресс-SPA для ног" img=""
                subtitle="Для тех, у кого нет времени на длительные процедуры восстановления кожи ног. Экспресс-SPA со особенной свечой - это лучшее завершение сеанса педикюра, которое поможет вам расслабиться. Ценные масла и витамины, спрятанные в воске свечи, не только смягчат, увлажнят и напитают вашу кожу, но и поднимут настроение, напомнив вам о любви к себе."
                price="200"></app-card>
        </div>
        <div class="card" id="5">
            <h2 class="card-title">Виды покрытий</h2>
            <app-card title="Покрытие Luxio" img=""
                subtitle="Гель-лак luxio обладает и защищает ногтевую пластину от поломки и укрепляет ее: в составе геля нет растворителей и бонда, но есть небольшой процент эфирного масла и растительных экстрактов для укрепления и ухода за ногтями. Luxio не сушит ногти и не становится причиной их ломкости. Относится к классу люкс среди подобных продуктов, ввиду чего его стоимость определяется немного выше стандартной. оно того стоит."
                price="1 200"></app-card>
            <app-card title="Покрытие гель-лаком" img=""
                subtitle="Любое долговременное покрытие, закрепляющееся на ногтях при помощи специальных ламп. Покрытие качественным гель-лаком не вредит ногтю - вред наносит самостоятельное снятие гель-лака зубами и подручными средствами."
                price="1 000"></app-card>
            <app-card title="Покрытие Kinetics" img=""
                subtitle="Кinetics – профессиональные лаки, срок носки которых продержится от 2-х недель. Этот бренд отличает стойкость: в отличие от старых формул, покрытия kinetics не трескаются и не скалываются."
                price="500"></app-card>
            <app-card title="Лечебный лак" img=""
                subtitle="Лечебное покрытие напитывает ногтевую пластину витаминами, придает ей прочность и утолщает, выравнивает поверхность ногтя, предохраняет его от сколов и трещин."
                price="200"></app-card>
            <app-card title="Покрытие Kinetics" img=""
                subtitle="Кinetics – профессиональные лаки, срок носки которых продержится от 2-х недель. Этот бренд отличает стойкость: в отличие от старых формул, покрытия kinetics не трескаются и не скалываются."
                price="700"></app-card>
            <app-card title="Покрытие Luxio" img=""
                subtitle="Гель-лак luxio обладает и защищает ногтевую пластину от поломки и укрепляет ее: в составе геля нет растворителей и бонда, но есть небольшой процент эфирного масла и растительных экстрактов для укрепления и ухода за ногтями. Luxio не сушит ногти и не становится причиной их ломкости. Относится к классу люкс среди подобных продуктов, ввиду чего его стоимость определяется немного выше стандартной. оно того стоит."
                price="1 400"></app-card>
            <app-card title="Покрытие гель-лаком " img=""
                subtitle="Любое долговременное покрытие, закрепляющееся на ногтях при помощи специальных ламп. Покрытие качественным гель-лаком не вредит ногтю - вред наносит самостоятельное снятие гель-лака зубами и подручными средствами."
                price="1 200"></app-card>
        </div>
        <div class="card" id="6">
            <h2 class="card-title">
                Парикмахерские услуги
            </h2>
            <app-card title="Консультация" img="" subtitle="Бесплатная консультация 15 минут со стилистом. Подбор цвета, стрижки, ухода. Наши эксперты подберут для Вас образ, оценят ваше состояние волос и сориентирует по стоимости." price="Бесплатно"></app-card>
            <app-card title="Стрижка" img="" subtitle="Включает в себя мытье головы и сушку по форме. Работая с вашими волосами, мы учитываем их структуру и густоту для достижения лучшего результата, которым вы точно будете довольны." price="2 000"></app-card>
            <app-card title="Детская стрижка" img="" subtitle="Детские стрижки для девочек и мальчиков требуют еще большего внимания, чем работа со взрослыми. Мы несем ответственность за непоседливых детей, которые садятся в кресла к нашим стилистам и отвечаем за их безопасность, чтобы вы всегда были спокойны." price="900"></app-card>
            <app-card title="Укладка (короткие)" img="" subtitle="Укладка волос с помощью щетки-брашинга и стайлеров. Брашинг – универсальная расческа, способная заменить собой плойки и утюжки, которые неизбежно наносят вред волосам." price="1 200"></app-card>
            <app-card title="Укладка (средние)" img="" subtitle="Укладка волос с помощью щетки-брашинга и стайлеров. Брашинг – универсальная расческа, способная заменить собой плойки и утюжки, которые неизбежно наносят вред волосам." price="1500"></app-card>
            <app-card title="Укладка (длинные)" img="" subtitle="Укладка волос с помощью щетки-брашинга и стайлеров. Брашинг – универсальная расческа, способная заменить собой плойки и утюжки, которые неизбежно наносят вред волосам." price="2 000"></app-card>
            <app-card title="Мытье + сушка волос" img="" subtitle="Нет времени на укладку или просто надоело делать все самой? Давайте сделаем мы, а Вы пока выпьете кофе и расскажете, как Ваши дела." price="800"></app-card>
            <app-card title="Стрижка челки" img="" subtitle="Когда хочется чего-то новенького, но очень страшно. Мы делаем самые разные челки, вариации которых стилист подбирает под форму лица, особенности структуры волос и Ваш образ." price="500"></app-card>
        </div>
        <div class="card" id="7">
            <h2 class="card-title">Уходы для волос</h2>
            <app-card title="Экспресс-уход Вегетарианское чудо от Davines (короткие)" img="" subtitle="Идеальное решение для волос, нуждающихся в восстановлении и всего за 20 минут!" price="1 200"></app-card>
            <app-card title="Экспресс-уход Вегетарианское чудо от Davines (средние)" img="" subtitle="Идеальное решение для волос, нуждающихся в восстановлении и всего за 20 минут!" price="1 500"></app-card>
            <app-card title="Экспресс-уход Вегетарианское чудо от Davines (длинные)" img="" subtitle="Идеальное решение для волос, нуждающихся в восстановлении и всего за 20 минут!" price="2 000"></app-card>
            <app-card title="Кератиновое чудо от Davines (короткие)" img="" subtitle="Кератиновое чудо от Davines предназначено для глубокого восстановления сильно поврежденных волос. Оно мгновенно возвращает волосам здоровый внешний вид, кашемировую мягкость и сияющий блеск." price="2 000"></app-card>
            <app-card title="Кератиновое чудо от Davines (средние)" img="" subtitle="Кератиновое чудо от Davines предназначено для глубокого восстановления сильно поврежденных волос. Оно мгновенно возвращает волосам здоровый внешний вид, кашемировую мягкость и сияющий блеск." price="3 000"></app-card>
            <app-card title="Кератиновое чудо от Davines (длинные)" img="" subtitle="Кератиновое чудо от Davines предназначено для глубокого восстановления сильно поврежденных волос. Оно мгновенно возвращает волосам здоровый внешний вид, кашемировую мягкость и сияющий блеск." price="4 000"></app-card>
        </div>
        <div class="card" id="8">
            <h2 class="card-title">Брови</h2>
            <app-card title="Оформление бровей" img="" subtitle="Процедура удаления лишних волосков пинцетом, подчеркивающая природную форму бровей." price="600"></app-card>
            <app-card title="Архитектура бровей" img="" subtitle="Создание идеальной формы бровей при помощи эскиза, коррекции и заполнения зон хной или стойким красителем. В процедуру входят: эскиз brow-пастой, коррекция и окрашивание." price="1 500"></app-card>
            <app-card title="Окрашивание бровей" img="" subtitle="Окрашивание бровей краской или хной скрывает седину, редкость волосков и предотвращает выпадение." price="600"></app-card>
            <app-card title="Счастье для бровей" img="" subtitle="Восстановление после частого окрашивания, а также от природы жестих, лишенных густоты бровей. Благодаря натуральному составу, волоски становятся послушными и блестящими, их проще укладывать. «Счастье для бровей» можно выполнять до/во время/после окрашивания и ламинирования бровей. Или как самостоятельную процедуру. Состав полностью натуральный, противопоказаний нет." price="700"></app-card>
            <app-card title="Ламинирование бровей" img="" subtitle="Долговременная укладка бровей, которая имеет множество плюсов: брови становятся визуально шире, и даже самые непослушные и торчащие волоски ложатся идеально ровно. Эффект сохраняется до 2-х месяцев." price="1 800"></app-card>
            <app-card title="Оформление бровей + воск" img="" subtitle="Удаление лишних волосков пинцетом в сочетании с воском. Процедура позволяет подчеркнуть природную форму бровей и замедлить рост нежелательных волосков." price="700"></app-card>
            <app-card title="Воск комплекс" img="" subtitle="Удаление нежелательных волосков над верхней губой и на скулах при помощи васкинга." price="500"></app-card>
            <app-card title="Воск верхняя губа" img="" subtitle="Мягко и эффективно избавляет от нежелательного пушка над верхней губой без раздражений и боли. Регулярное удаление воском сделает волоски менее заметными и мягкими, сводя дискомфорт к нулю." price="300"></app-card>
            <app-card title="Оформление бровей + воск (густые брови)" img="" subtitle="Если ваши бровки отличаются особенной густотой, нашим мастерам нужно больше времени для достижения идеального результата. В процессе оказания услуги бровисты SODA удалят лишние волоски пинцетом и воском, подчеркивая природную форму." price="900"></app-card>
        </div>
        <div class="card" id="9">
            <h2 class="card-title">Ресницы</h2>
            <app-card title="Окрашивание ресниц" img="" subtitle="Окрашивание краской – несложный и эффективный способ сделать глаза ярче и выразительнее. Сама краска, в отличие от туши, закрашивает даже самые мелкие волоски, и ресницы визуально выглядят гуще." price="600"></app-card>
            <app-card title="Ламинирование ресниц" img="" subtitle="" price="2 500"></app-card>
        </div>
        <div class="card" id="10">
            <h2 class="card-title">Для мужчин</h2>
            <app-card title="Мужской маникюр" img="" subtitle="Гигиеническая обработка мужских пальцев рук техникой на выбор: классической или комбинированной. В стоимость не включен индивидуальный набор (40 рублей).1 200 ₽" price="1 200"></app-card>
            <app-card title="Мужской SMART-педикюр" img="" subtitle="SMART-педикюр – это технология обработки стопы аппаратом с использованием специального шлифовального диска." price="2 350"></app-card>
            <app-card title="Мужской педикюр" img="" subtitle="Полноценная обработка стопы от ороговевшей кожи и обработка ногтей от лишних наростов кутикулы. педикюр выполняется либо классической, либо комбинированной техникой. мастера soda избавят вас от дискомфортных ощущений при носке обуви и скорректируют форму ногтя. В стоимость не включен индивидуальный набор (40 рублей)." price="1 700"></app-card>
            <app-card title="Оформление бровей для мужчин" img="" subtitle="Быстрая коррекция жестких мужских бровей с применением пинцета и воска. Носит эстетический характер и избавляет вас от торчащих волосков." price="900"></app-card>
        </div>
        <div class="card" id="11">
            <h2 class="card-title">Дополнительные услуги</h2>
            <app-card title="Укрепление гелем" img="" subtitle="Укрепление ногтей гелем необходимо при ослабленных тонких ногтях, склонных к расслоению и ломкости. Подходит так же для носителей длинных ногтей и гнущихся ногтевых пластин." price="1 200"></app-card>
            <app-card title="Выравнивание базой" img="" subtitle="С помощью выравнивания базового покрытия мастера нашей сети делают ваши ногти безупречными, а покрытие идеально ровным. Из бонусов: идеальная глянцевая поверхность и вызывающие восторг блики на ноготках при любом освещении. Очень залипательно!" price="400"></app-card>
            <app-card title="Ремонт ногтевой пластины" img="" subtitle="Один сломанный ноготь - не повод для тотального спиливания. В SODA восстанавливают все виды надломов и повреждений, даже под корень." price="200"></app-card>
            <app-card title="Скраб" img="" subtitle="Скрабирование очищает кожу от ороговевших (мертвых) клеток. Выравнивает рельеф кожи, делая тон ровным и свежим." price="350"></app-card>
            <app-card title="Массаж" img="" subtitle="Снимаем усталость через ваши ручки, минимизируя стресс и отгоняя прогнозы лунного календаря (только нехорошие, конечно). Точечный массаж усилит кровообращение в тканях, обновляя и омолаживая кожу рук. Мы знаем, куда надавить, чтобы все плохое осталось в стороне." price="350"></app-card>
            <app-card title="Полировка ногтей" img="" subtitle="Для идеально ровной блестящей поверхности, натуральных ногтей." price="150"></app-card>
            <app-card title="Парафинотерапия" img="" subtitle="" price="350"></app-card>
            <app-card title="Укрепление акриловой пудрой" img="" subtitle="Благодаря акриловому укреплению, покрытие на ваших ногтях становится прочнее и менее подвержено сколам при ослабших ногтях." price="500"></app-card>
            <app-card title="Удаление мозолей/натоптышей" img="" subtitle="" price="350"></app-card>
        </div>
        <div class="card" id="12">
            <h2 class="card-title">Наращивание ногтей</h2>
            <app-card title="Наращивание гелем + маникюр + покрытие гель-лаком" img="" subtitle="Удлинение ногтевой пластины за счет прочного гелиевого состава, который не ломается и не трескается. При наращивании сколы и царапины минимизируются, а форма и эстетика гармоничны натуральному ногтю. В стоимость не включен индивидуальный набор (40 рублей)" price="3 500"></app-card>
            <app-card title="Коррекция наращенных ногтей гелем+ маникюр + покрытие гель-лаком" img="" subtitle="Полное или частичное удаление/замена материала, нанесенного ранее. Коррекция или изменение формы ногтевой пластины и покрытие гель-лаком. В стоимость не включен индивидуальный набор (40 рублей)." price="3 200"></app-card>
            <app-card title="Снятие геля/акрила" img="" subtitle="Безопасное снятие покрытия специальной маникюрной фрезой, которая не вредит живому ногтю и травмирует его. В стоимость не включен индивидуальный набор (40 рублей)" price="600"></app-card>

        </div>
        <div class="card" id="13">
            <h2 class="card-title">Дизайн</h2>
            <app-card title="Френч" img="" subtitle="Вечная классика, о которой не нужно говорить. В SODA возможны все варианты френча в разных цветовых палитрах." price="500"></app-card>
            <app-card title="Кошачий глаз" img="" subtitle="Эффект кошачьего глаза на ногтях достигается за счет взаимодействия магнита в руках мастера и металлических частиц в составе покрытия. Выбор чародейки или немножко ведьмы." price="200"></app-card>
            <app-card title="Наклейка" img="" subtitle="Готовый дизайн под покрытие. База наклеек постоянно обновляется, поэтому не стесняйтесь спрашивать у мастера, что новенького появилось в SODA." price="50"></app-card>
            <app-card title="Простой дизайн 1 палец" img="" subtitle="Простой дизайн, создающийся легкими касаниями кисти: точки, капли и полоски." price="от 50"></app-card>
            <app-card title="Втирка 1 палец" img="" subtitle="Виды втирок: зеркальные, радужные, перламутровые. Возможны любые миксы и сочетания." price="200"></app-card>
            <app-card title="Втирка все пальцы" img="" subtitle="Виды втирок: зеркальные, радужные, перламутровые. Возможны любые миксы и сочетания." price="800"></app-card>
            <app-card title="Мрамор 1 палец" img="" subtitle="Когда хочется прекрасного, но акцентно." price="200"></app-card>
            <app-card title="Мрамор все пальцы" img="" subtitle="Напоминание о величественной архитектуре и настоящее искусство на пальчиках рук." price="500"></app-card>
            <app-card title="Стразы" img="" subtitle="Готовый дизайн на покрытие. Наборы страз постоянно обновляются, поэтому не стесняйтесь спрашивать у мастера, что новенького появилось в SODA." price="25"></app-card>
            <app-card title="Сложный дизайн 1 палец" img="" subtitle="Усложненный дизайн с геометрией, но не художественный." price="от 100"></app-card>
            <app-card title="Художественная роспись 1 палец" img="" subtitle="Ручная работа мастера на ногтях по мотивам Вашей сумасшедшей фантазии." price="350"></app-card>
            <app-card title="Лунный" img="" subtitle="Лунный френч на ногтях — это дизайн ногтевых пластин, похожий на французский маникюр, но белая (светлая) часть выполняется не на кончике ноготка, а у его основания — лунки. Эстетично на ногтях любой длины и формы." price="500 "></app-card>
            <app-card title="Омбре 1 палец" img="" subtitle="Плавный переход одного цвета в другой." price="200"></app-card>
            <app-card title="Омбре все пальцы" img="" subtitle="Плавный переход одного цвета в другой." price="800"></app-card>
        </div>
    </div>


</template>

<script>
import AppHeader from '@/components/AppHeader.vue';
import AppCard from '@/components/AppCard.vue';
export default {

    setup() {
        const service = [
            { idx: '#1', name: 'Покрашивание волос', id: 1 },
            { idx: '#2', name: 'Комплекс услуг', id: 2 },
            { idx: '#3', name: 'Маникюр', id: 3 },
            { idx: '#4', name: 'Педикюр', id: 4 },
            { idx: '#5', name: 'Виды покрытий', id: 5 },
            { idx: '#6', name: 'Парикмахерские услуги', id: 6 },
            { idx: '#7', name: 'Уходы для волос', id: 7 },
            { idx: '#8', name: 'Брови', id: 8 },
            { idx: '#9', name: 'Ресницы', id: 9 },
            { idx: '#10', name: 'Для мужчин', id: 10 },
            { idx: '#11', name: 'Дополнительные услуги', id: 11 },
            { idx: '#12', name: 'Наращивание ногтей', id: 12 },
            { idx: '#13', name: 'Дизайн', id: 13 },
        ]


        return {
            service
        }
    },
    components: { AppHeader, AppCard }
}
</script>

<style lang="scss" scoped>
.wrapper {
    margin-top: 10px;
    height: 75vh;
    overflow-y: scroll;
    overflow-x: hidden;
}

.card {
    flex-wrap: wrap;
    background: rgba(255, 255, 255, 0.048);

    &-link {
        margin: 20px 20px 0 20px;
    overflow: hidden;
    padding: 20px;
    border: 1px solid #333;
    border-radius: 12px;
    }

    &-title {
        font-size: 30px;
        margin-bottom: 10px;
        color: #fff;
    }
}

.link {
    &-container {
        display: flex;
        align-items: center;
        justify-content: space-between;
        gap: 20px;
        overflow-y: hidden;
        overflow-x: scroll;
    }

    &-router {
        display: inline-block;
        width: 400px;
        padding: 10px 20px;
        height: fit-content;
        border-radius: 40px;
        background-color: rgba(247, 242, 242, 0.103);
        transition: 0.5s;
        border: 2px solid #fff;
        color: #fff;

        &:hover {
            background: rgba(255, 0, 0, 0.144);
            color: #fff;
        }

        &:active {
            background: #333;
            color: #fff;
        }
    }
}

.card-flex {
    width: 100%;
    border-top: 2px solid #333;
    border-bottom: 2px solid #333;
}
</style>